; domain
(define (domain logistics)

  (:requirements :strips :typing)

  (:types
        physobj location - object
        robot gold_mine - physobj
        tiles - location
  )

  (:predicates
		(at ?obj - physobj ?loc - location)
		(right ?loc-from - location ?loc-to - location)
		(left ?loc-from - location ?loc-to - location)
		(up ?loc-from - location ?loc-to - location)
		(down ?loc-from - location ?loc-to - location)
		(has_gold)
  )


 (:action right
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (right ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action left
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (left ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action down
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (down ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action up
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (up ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action dig
    :parameters (?b - robot ?loc-from - location )
    :precondition (and (at ?b ?loc-from) (at g ?loc-from ))
    :effect (has_gold)
 )
)

; problem
(define (problem pb_logistics)
    (:domain logistics)
    
    (:objects
        b - robot
        g - gold_mine 
		loc_2_3 loc_2_4 loc_2_5 loc_3_3 loc_3_4 loc_3_5 loc_4_3 loc_4_4 loc_4_5 loc_5_3 loc_5_4 loc_5_5 loc_6_3 loc_6_4 loc_6_5 - tiles 
 	)

    (:init
        (at b loc_6_3)
        (at g loc_2_5) 
		(right loc_2_3 loc_2_4) (right loc_2_4 loc_2_5) (right loc_3_3 loc_3_4) (right loc_3_4 loc_3_5) (right loc_4_3 loc_4_4) (right loc_4_4 loc_4_5) (right loc_5_3 loc_5_4) (right loc_5_4 loc_5_5) (right loc_6_3 loc_6_4) (right loc_6_4 loc_6_5) 
		(left loc_2_4 loc_2_3) (left loc_2_5 loc_2_4) (left loc_3_4 loc_3_3) (left loc_3_5 loc_3_4) (left loc_4_4 loc_4_3) (left loc_4_5 loc_4_4) (left loc_5_4 loc_5_3) (left loc_5_5 loc_5_4) (left loc_6_4 loc_6_3) (left loc_6_5 loc_6_4) 
		(down loc_2_3 loc_3_3) (down loc_2_4 loc_3_4) (down loc_2_5 loc_3_5) (down loc_3_3 loc_4_3) (down loc_3_4 loc_4_4) (down loc_3_5 loc_4_5) (down loc_4_3 loc_5_3) (down loc_4_4 loc_5_4) (down loc_4_5 loc_5_5) (down loc_5_3 loc_6_3) (down loc_5_4 loc_6_4) (down loc_5_5 loc_6_5) 
		(up loc_3_3 loc_2_3) (up loc_3_4 loc_2_4) (up loc_3_5 loc_2_5) (up loc_4_3 loc_3_3) (up loc_4_4 loc_3_4) (up loc_4_5 loc_3_5) (up loc_5_3 loc_4_3) (up loc_5_4 loc_4_4) (up loc_5_5 loc_4_5) (up loc_6_3 loc_5_3) (up loc_6_4 loc_5_4) (up loc_6_5 loc_5_5) 
	)

    (:goal
        (and (at b loc_6_3) (has_gold))
    )
)

; plan
1. (right b loc_6_3 loc_6_4)
   deleted: (at b loc_6_3)
   added: (at b loc_6_4)
   goals met: 0 of 2
2. (right b loc_6_4 loc_6_5)
   deleted: (at b loc_6_4)
   added: (at b loc_6_5)
   goals met: 0 of 2
3. (up b loc_6_5 loc_5_5)
   deleted: (at b loc_6_5)
   added: (at b loc_5_5)
   goals met: 0 of 2
4. (up b loc_5_5 loc_4_5)
   deleted: (at b loc_5_5)
   added: (at b loc_4_5)
   goals met: 0 of 2
5. (up b loc_4_5 loc_3_5)
   deleted: (at b loc_4_5)
   added: (at b loc_3_5)
   goals met: 0 of 2
6. (up b loc_3_5 loc_2_5)
   deleted: (at b loc_3_5)
   added: (at b loc_2_5)
   goals met: 0 of 2
7. (dig b loc_2_5)
   added: (has_gold)
   goals met: 1 of 2
8. (left b loc_2_5 loc_2_4)
   deleted: (at b loc_2_5)
   added: (at b loc_2_4)
   goals met: 1 of 2
9. (left b loc_2_4 loc_2_3)
   deleted: (at b loc_2_4)
   added: (at b loc_2_3)
   goals met: 1 of 2
10. (down b loc_2_3 loc_3_3)
   deleted: (at b loc_2_3)
   added: (at b loc_3_3)
   goals met: 1 of 2
11. (down b loc_3_3 loc_4_3)
   deleted: (at b loc_3_3)
   added: (at b loc_4_3)
   goals met: 1 of 2
12. (down b loc_4_3 loc_5_3)
   deleted: (at b loc_4_3)
   added: (at b loc_5_3)
   goals met: 1 of 2
13. (down b loc_5_3 loc_6_3)
   deleted: (at b loc_5_3)
   added: (at b loc_6_3)
   goals met: 2 of 2
